Gangleri42/qr-bridge/sdkconfig.defaults
# qr-bridge on the Waveshare ESP32-P4-Pico. Only what differs from the
# ESP-IDF defaults. The console is UART0 at 115200 (the CH343P on the
# USB-C connector), which is the default.

CONFIG_IDF_TARGET="esp32p4"

# The module's flash part.
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y

# The PN532 driver waits in 1 to 3 ms steps.
CONFIG_FREERTOS_HZ=1000

# The same commit gives the same binary: no compile date or time, no
# build paths in the ELF.
CONFIG_APP_REPRODUCIBLE_BUILD=y
